Revit 2024 API
FailureMessageKey.Equality Operator
Determines whether two FailureMessageKeys are the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static bool operator ==(
	FailureMessageKey first,
	FailureMessageKey second
)
Visual Basic
Public Shared Operator = ( _
	first As FailureMessageKey, _
	second As FailureMessageKey _
) As Boolean
Visual C++
public:
static bool operator ==(
	FailureMessageKey^ first,
	FailureMessageKey^ second
)
Parameters
first
Type: Autodesk.Revit.DB.FailureMessageKey
The first FailureMessageKey.
second
Type: Autodesk.Revit.DB.FailureMessageKey
The second FailureMessageKey.
Return Value
True if the FailureMessageKeys are the same; otherwise, false.
See Also
FailureMessageKey Class
Autodesk.Revit.DB Namespace